{
  "landing": {
    "choose_language": "Choose language:",
    "tooltips": {
      "github": "Go to my GitHub repository",
      "contact": "Contact me",
      "projects": "See my projects"
    },
    "nav": {
      "about": "About me",
      "projects": "My projects",
      "contact": "Contact me"
    },
    "greeting": "Hi! My name is Ignacy.",
    "about": "I make web-apps tailored for any client's needs.",
    "bio": "As a <b>full-stack developer</b> I'm focused on building <b>clean</b>, <b>user-friendly</b> applications from front to back. I bring both <b>technical</b> and <b>design</b> sensibilities to the table, working closely with clients to turn <b>ideas</b> into <b>reliable, well-crafted digital products</b>."
  },
  "aboutMe": {
    "header": "About me.",
    "mobileText": {
      "line_1": "My name is Ignacy and I'm a freelancing <b>full-stack</b> web developer.",
      "line_2": "My main stack is <b>Node.js</b> and <b>React</b> w/ various UI frameworks.",
      "line_3": "I'm experienced in working with clients turning wishes into reality through <b>code</b> and <b>personalized UI designs</b> fit according to my clients' needs."
    }
  },
  "recentProjects": {
    "header": "Recent projects.",
    "description": "Description",
    "try_it": "Try it!",
    "features": "Features",
    "tooltips": {
      "github": "See repository",
      "appStore": "Open Apple AppStore page",
      "googlePlay": "Open Google Play Store page",
      "live_url": "Go to website"
    },
    "projects": {
      "artCollector": {
        "name": "artCollector",
        "description": "Personal art collection catalogue web-app",
        "accordion_data": {
          "description": "This is an early version of a full-stack CRUD webapp meant for cataloguing small art collections for personal use. Its development was ordered by a member of a group of people collecting art as their hobby.\n\n It's a free, mobile-friendly and easy-to-use alternative to the unintuitive desktop-only collection managers that thus far were the only avaible option on the market.\n\n It was built using Node.js w/ jQuery and Bootstrap.",
          "features": "<li>Fully-fledged art catalogue app suitable for both desktop and mobile use </li> <li>Data table w/ rich customization options and a search function</li> <li> Elegant minimalistic show page design w/ custom made carousels that automatically adapt to various images sizes </li> <li> Two types of leaflets (png files meant for printing) that can be automatically generated for each piece </li> <li> Raw collection data can be exported to an xlsx file on one click of a button </li> <li> Each user can choose to make their collection either public, private or only visible upon entering a passcode </li> <li> Forgot Password service using auto-generated token sent on user's email </li>",
          "try_it": "It will be an honor to have you try out this app!\n\n For this occasion, I've provided a demo account filled with dummy data.\n\n The currently public alpha version of the app is deployed on a free-tier server and thus the title page make take as long as about 60 seconds to load if the page has not been visited for a short while. I apologize for this incovenience.\n\n Username: vanGoghFan\n\n Password: i<3VanGogh\n\n Have fun!"
        }
      },
      "neuroCare": {
        "name": "NeuroCare",
        "description": "Landing page for a medical facility",
        "accordion_data": {
          "description": "A simple landing page with a contact form. I've designed top and bottom screens and developed the whole page from scratch. I've also modified the SVG icons provided by my client for the sake of design coherence.",
          "features": "<li>Responsive design optimized for both desktop and mobile devices</li> <li>Custom-designed hero and footer sections for brand consistency</li> <li>Interactive contact form with client-side validation</li> <li>Form submissions integrated with backend API</li> <li>SVG icons modified for visual consistency and performance</li> <li>Smooth scrolling and subtle animations for enhanced UX</li>"
        }
      },

      "olaPortfolio": {
        "name": "Photographer's portfolio",
        "description": "Custom photographer's portfolio webiste",
        "accordion_data": {
          "description": "My client had a very clean vision of what she had wanted her website to look like.\n\n Based on her set of guidelines I prepared a visual UI sketch which I have then turned into code.\n\n Components such as carousel and slideshow had to be designed from scratch as the ones from UI component libraries didn't fit the aesthetic choices ordered by my client.\n\n The site was built using React w/ Tailwind.",
          "features": "<li>Original minimalistic design based on my client's guidelines.</li> <li> Fully functional Content Management System, fit for my client's requirements. </li> <li> Modular code design that makes editing the content a matter of seconds. </li> <li> Slideshows and carousels written from scratch to allow both portrait and landscape orientation images in one series and also to fit the design choices. </li>"
        }
      },

      "sprawdzFodmap": {
        "name": "sprawdzFodmap",
        "description": "Interactive diet database & info-hub for patients with gut health issues",
        "accordion_data": {
          "description": "This webapp is a fruit of the labour of a small team of professionals led by myself.\n\n It is the first clinical diet web-app available in polish - the aim was to give aid to the people not fluent in english enough to be able to easily obtain crucial info on their diets in a non-clinical enviroment.\n\nThe database has been compiled basing on a carefully selected set of scientific resources.\n\nThe code was written by me in React w/ components from MUI.",
          "features": " <li>Check what you should and shouldn't eat on a lowFODMAP/anti-HIT diet in a matter of literal seconds using quick search function available on the homepage </li> <li> Learn the dietary restrictions category by category by working through the easily navigatble set of tables </li> <li>First such webapp available on polish market</li> <li>Fully responsive design makes the webapp suitable for on-the-go usage </li>"
        }
      },
      "topstersClassic": {
        "name": "Topsters Classic",
        "description": "Music album chart image generator based on a legacy website with a cult status among music forums",
        "accordion_data": {
          "description": "Topsters Classic is a hobby project that I have made, channeling my nostalgia for the original Topsters page that I've used as a teen lurking music forums circa 2013.\n\n The UI of the app itself is designed from scratch for it to be up to today's standards; especially in regards to mobile use.\n\n The design of the charts is recreated from the original charts designsand the credit for them is due to the developer of the original app.",
          "features": "<li>Create your own charts using a highly customizable editor</li> <li>Three chart designs, incl. one with user-customizable size</li> <li> Either export your charts or save them for later thanks to easy-to-use storage system </li> <li> Now also easily available on mobile devices thanks to responsive UI design </li> <li> New chart editing system that lets the user add new positions quickly by clicking instead of draggin, with image position auto-advancing </li> <li>Original Top 100 and Top 40 designs available again</li>"
        }
      },
      "worryFree": {
        "name": "WorryFree - Pocket CBT Aid",
        "description": "Mobile self-help app providing science-based, easy-to-use psychotherapeutic interventions on-the-go",
        "accordion_data": {
          "description": "WorryFree is a mobile app that offers evidence-based, easy-to-use cognitive-behavioral psychotherapeutic interventions.\n\nIts mission is to promote mental well-being for all by making science-based self-help tools more accessible in today’s fast-paced world.\n\nWell is a small team passion project led by myself. It is currently in its early stages, with a commitment to continuous development.",
          "features": "<li>Seamless UI experience - sleek design and custom animations</li> <li>Full localization - currently available in both English and Polish<li> Cognitive behavioral interventions of scientifically proven efficacy tailored for on-the-go access </li> <li>Customizable relaxation exercises</li> <li>Exercise archive with advanced filtering options</li> <li>Satisfying achievement system</li> <li>Personalized, customizable experience for every user</li> <li> Learn section with ever-expanding set of scientific and lifestyle articles </li>"
        }
      }
    }
  },
  "contactMe": {
    "header": "Contact me."
  }
}
